#+TITLE: Project Management
* Bugs
** DONE Wenn beim Import eine leere Zeile ist, werden alle Karten für die Vorschau geladen
- State "DONE"       from "STARTED"    [2020-02-04 Di 19:34]
- State "STARTED"    from "STARTED"    [2020-02-04 Di 19:29]
:LOGBOOK:
CLOCK: [2020-02-04 Di 19:29]--[2020-02-04 Di 19:34] =>  0:05
:END:
** DONE Unique-Constrain für Library-ID und Card-ID einführen
- State "DONE"       from "STARTED"    [2020-02-05 Mi 21:18]
- State "STARTED"    from "STARTED"    [2020-02-05 Mi 20:44]
:LOGBOOK:
CLOCK: [2020-02-05 Mi 20:44]--[2020-02-05 Mi 21:18] =>  0:34
:END:
** DONE Eingabe von Karten beim Import in anderen Sprachen
- State "DONE"       from "TODO"       [2020-02-06 Do 22:07]
- State "STARTED"    from "STARTED"    [2020-02-06 Do 22:07]
:LOGBOOK:
CLOCK: [2020-02-06 Do 19:57]--[2020-02-06 Do 22:07] =>  2:10
:END:
** DONE Beim hinzufügen von Karten, möchte ich sagen können, ob die Karte eine Foil-Karte ist.
- State "DONE"       from "TODO"       [2020-02-08 Sa 09:27]
** DONE Beim importieren von Karten sollte der Set-Code casinsensitive sein
- State "DONE"       from "TODO"       [2020-02-09 So 17:23]
* UserStories
** Library Management
*** TODO Als Benutzer möchte ich die Anzahl der Karten in einer Bibliothek ändern
*** TODO Als Benutzer möchte ich die Karten einer Bibliothek filtern
*** TODO Als Benutzer möchte ich die Karten einer Bibliothek paginiert betrachten
*** TODO Als Benutzer möchte ich eine Bibliothek veröffentlichen
*** TODO Als Benutzer erwarte ich eine Zugangsbeschränkung zu meinen Bibliotheken
*** DONE Als Benutzer möchte ich Karten anhand ihrer Set-Nummer und Set importieren können
- State "DONE"       from "TODO"       [2020-02-09 So 12:54]
*** TODO Als Benutzer möchte ich sehen wie viele Karten ich in einer Bibliothek habe.
** Deck Management
*** DONE Als Benutzer möchte ich eine Übersicht der Decks haben
- State "DONE"       from "TODO"       [2020-02-16 So 12:14]
*** TODO Als Benutzer möchte ich die Decks filtern
*** TODO Als Benutzer möchte ich die Decks paginiert betrachten
*** TODO Als Benutzer möchte ich die Decks sortieren
*** TODO Als Benutzer möchte ich mir Details einer Decks ansehen
*** TODO Als Benutzer möchte ich die Karten eines Decks ansehen
*** DONE Als Benutzer möchte ich ein neues Deck hinzufügen
- State "DONE"       from "TODO"       [2020-02-16 So 12:14]
*** TODO Als Benutzer möchte ich Karten zu einem Deck hinzufügen
*** DONE Als Benutzer möchte ich ein Deck veröffentlichen
- State "DONE"       from "TODO"       [2020-02-16 So 12:14]
*** DONE Als Benutzer erwarte ich eine Zugangsbeschränkung zu meinen Decks
- State "DONE"       from "TODO"       [2020-02-16 So 12:14]
** User Management
*** TODO Als Benutzer möchte ich mein Passwort ändern
** Set Management
*** Als Benutzer möchte ich alle Sets sehen um zu sehen welche Sets es alles gibt
Hier sollte Neben dem Icon auch der Code sichtbar sein, damit man diesen für den
Import benutzen kann.
** Card Management
*** TODO Als Benutzer möchte ich alle Karten sehen damit ich entdecken kann, welche Karten ich für meine Decks noch benutzen könnte.
*** TODO Als Benutzer möchte ich die Karten filtern
Nach welchen Kriterien möchte ich filtern?
*** TODO Als Benutzer möchte ich die Karten paginiert betrachten
*** TODO Als Benutzer möchte ich die Karten sortieren
Nach welchen Kriterien möchte sortieren?
* Rollen
** Besucher: Jemand der die Anwendung ohne Authorisierung ansurft.
** Benutzer: Jemand der sich bei der Anwendung angemeldet hat.
** Admin: Ein Benutzer der andere Benutzer anlegen kann
* R&D
** Als Entwickler möchte ich auch erweiterte Frontend funktionalitäten haben
Eine Möglichkeit währe das ich die React Komponenten sowohl im Backend als auch
im Frontend benutze und dann die Frontend-Komponten das gerenderte HTML
übernehmen.
